'''
                                        Максимальный в области 2 🌶️
Напишите программу, которая выводит максимальный элемент в заштрихованной области (ЛЕВАЯ И ПРАВАЯ ЧЕТВЕРТЬ МАТРИЦЫ) квадратной матрицы.

Формат входных данных
На вход программе подаётся натуральное число n — количество строк и столбцов в матрице, затем элементы матрицы (целые числа) построчно через пробел.

Формат выходных данных
Программа должна вывести одно число — максимальный элемент в заштрихованной области квадратной матрицы.

Примечание. Элементы диагоналей также учитываются.
'''


n = int(input())
matrix = [[int(e) for e in input().split()] for _ in range(n)]
maximum = matrix[0][0]

for i in range(n):
    for j in range(n):
        if i >= j and i <= n - 1 - j or i <= j and i >= n - 1 - j:
            maximum = max(maximum, matrix[i][j])

print(maximum)